{"keras_version": "2.0.9", "backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 28, 28, 1], "name": "input_1"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_1", "activation": "linear", "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 32, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "gamma_constraint": null, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2", "activation": "linear", "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 32, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "gamma_constraint": null, "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_3", "activation": "linear", "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 96, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "gamma_constraint": null, "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_5", "activation": "linear", "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 64, "kernel_size": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "gamma_constraint": null, "name": "batch_normalization_5", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_6", "activation": "linear", "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 48, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "gamma_constraint": null, "name": "batch_normalization_6", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "activation_6", "trainable": true}, "class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "strides": [1, 1], "name": "average_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "same"}, "class_name": "AveragePooling2D", "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_4", "activation": "linear", "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 32, "kernel_size": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_7", "activation": "linear", "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 48, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_8", "activation": "linear", "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 16, "kernel_size": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "gamma_constraint": null, "name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "gamma_constraint": null, "name": "batch_normalization_7", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "gamma_constraint": null, "name": "batch_normalization_8", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "activation_7", "trainable": true}, "class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "activation_8", "trainable": true}, "class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["activation_4", 0, 0, {}], ["activation_7", 0, 0, {}], ["activation_8", 0, 0, {}]]]}, {"config": {"name": "add_1", "trainable": true}, "class_name": "Add", "name": "add_1", "inbound_nodes": [[["concatenate_1", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "activation_9", "trainable": true}, "class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "strides": [3, 3], "name": "average_pooling2d_2", "trainable": true, "pool_size": [3, 3], "padding": "valid"}, "class_name": "AveragePooling2D", "name": "average_pooling2d_2", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"config": {"seed": null, "trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.2}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "activity_regularizer": null, "units": 345, "bias_regularizer": null, "trainable": true, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_1", 0, 0]]}}